---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.DuctLiningType
source: html/46c6c2df-2b59-7d65-c4b1-f92c7d17099c.htm
---
# DuctLiningType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.